In [1]:
import pandas as pd

In [2]:
big = pd.DataFrame({'department':['A','A','B','B'], 'gender':['male','female','male','female'],'count':[1,2,3,1]})
small = pd.DataFrame({'department':['A','B'], 'total':[3,4]})

In [3]:
display("big",big)
display("small",small)

'big'

  department  gender  count
0          A    male      1
1          A  female      2
2          B    male      3
3          B  female      1

'small'

  department  total
0          A      3
1          B      4

In [10]:
pd.merge(small,big) 
small.merge(big)

  department  total  gender  count
0          A      3    male      1
1          A      3  female      2
2          B      4    male      3
3          B      4  female      1

In [16]:
학생 = pd.DataFrame({
    '이름': ['지민', '태형', '윤기', '호석'],
    '동아리': ['음악', '미술', '체육', '음악']
})

동아리 = pd.DataFrame({
    '동아리': ['음악', '미술', '체육', '과학'],
    '선생님': ['김선생님', '이선생님', '박선생님', '최선생님']
})

결과 = 학생.merge(동아리, left_on='동아리', right_on='동아리',how='outer')
결과

    이름 동아리   선생님
0   지민  음악  김선생님
1   호석  음악  김선생님
2   태형  미술  이선생님
3   윤기  체육  박선생님
4  NaN  과학  최선생님

In [10]:
학생 = pd.DataFrame({
    '이름': ['지민', '태형', '윤기', '호석'],
    '동아리': ['음악', '미술', '체육', '음악'],
    '학년': [1, 2, 3, 1]
})

동아리 = pd.DataFrame({
    '동아리': ['음악', '미술', '체육', '과학'],
    '학년': [1, 2, 3, 4],
    '선생님': ['김선생님', '이선생님', '박선생님', '최선생님']
})

결과 = 학생.merge(동아리)
결과

   이름 동아리  학년   선생님
0  지민  음악   1  김선생님
1  호석  음악   1  김선생님
2  태형  미술   2  이선생님
3  윤기  체육   3  박선생님